const About = () => {
    return (
        <div className="px-2 md:px-4 my-10">
            <div className="text-center mb-10">
                <h1 className="text-3xl font-bold text-center mb-2 text-[#027afb]">
                    আমাদের সম্পর্কে
                </h1>
                <p>শিক্ষায় উৎকর্ষতার পথে একসাথে অগ্রসর হচ্ছি</p>
            </div>

            <div className="grid grid-cols-1 md:grid-cols-2 gap-4 md:gap-8">
                <div className="order-2 md:order-1">
                    <p className="bg-[#027afb10] p-4 rounded-lg mb-2">
                        আমরা বিশ্বাস করি যে একটি সুশৃঙ্খল এবং সহায়ক পরিবেশে
                        শিক্ষার্থীরা তাদের পূর্ণ সম্ভাবনা বিকশিত করতে পারে।
                        আমাদের বিদ্যালয়টি শুধু পাঠ্যসূচী নয়, বরং ছাত্র-ছাত্রীদের
                        মানসিক ও শারীরিক বিকাশেও মনোযোগী। আমরা শ্রেষ্ঠত্বের
                        প্রতি প্রতিজ্ঞাবদ্ধ, এবং আমাদের লক্ষ্য হলো শিক্ষার্থীদের
                        বুদ্ধিবৃত্তিক দক্ষতা, সৃজনশীলতা এবং সামাজিক দায়িত্ববোধ
                        বিকাশে সহায়তা করা। আমরা আমাদের শিক্ষার্থীদের এমন এক
                        পরিবেশ প্রদান করতে প্রতিজ্ঞাবদ্ধ যেখানে তারা শুধুমাত্র
                        গুনগত শিক্ষাই পায় না, বরং একজন আত্মবিশ্বাসী, পরিপূর্ণ
                        মানুষ হিসেবে নিজেদের তৈরি করতে পারে। আমাদের শিক্ষকদের দল
                        অত্যন্ত অভিজ্ঞ এবং তারা শিক্ষার্থীদের সঠিক দিকনির্দেশনা
                        দেওয়ার জন্য সর্বদা প্রস্তুত।
                    </p>
                    <p className="bg-[#027afb10] p-4 rounded-lg mb-2">
                        আমরা শ্রেষ্ঠত্বের প্রতি প্রতিজ্ঞাবদ্ধ, এবং আমাদের লক্ষ্য
                        হলো শিক্ষার্থীদের বুদ্ধিবৃত্তিক দক্ষতা, সৃজনশীলতা এবং
                        সামাজিক দায়িত্ববোধ বিকাশে সহায়তা করা। আমরা আমাদের
                        শিক্ষার্থীদের এমন এক পরিবেশ প্রদান করতে প্রতিজ্ঞাবদ্ধ
                        যেখানে তারা শুধুমাত্র গুনগত শিক্ষাই পায় না, বরং একজন
                        আত্মবিশ্বাসী, পরিপূর্ণ মানুষ হিসেবে নিজেদের তৈরি করতে
                        পারে।
                    </p>
                    <div className="bg-[#027afb10] p-4 rounded-lg">
                        <ul className="flex flex-col gap-2">
                            <li>
                                <h1 className="font-bold">
                                    উন্নত শিক্ষাব্যবস্থা
                                </h1>
                                <p>
                                    আমাদের শিক্ষাব্যবস্থা শিক্ষার্থীদের জন্য
                                    একটি আধুনিক, কার্যকর এবং সমন্বিত পদ্ধতিতে
                                    শিক্ষা প্রদান করে, যা তাদের ভবিষ্যত সাফল্যের
                                    জন্য প্রস্তুত করে।
                                </p>
                            </li>
                            <li>
                                <h1 className="font-bold">বিশ্বস্ত শিক্ষকগণ</h1>
                                <p>
                                    আমাদের শিক্ষকরা প্রফেশনাল এবং শিক্ষাদান
                                    পদ্ধতিতে দক্ষ। তারা সবসময় শিক্ষার্থীদের পাশে
                                    থেকে তাদের উন্নতির জন্য কাজ করেন।
                                </p>
                            </li>
                            <li>
                                <h1 className="font-bold">
                                    শারীরিক ও মানসিক বিকাশ
                                </h1>
                                <p>
                                    আমাদের বিদ্যালয়ে শিক্ষার্থীদের মানসিক ও
                                    শারীরিক বিকাশের জন্য বিশেষ সুবিধা যেমন
                                    ক্রীড়া, সঙ্গীত, চিত্রকলা ইত্যাদি বিভিন্ন
                                    কার্যক্রম রয়েছে।
                                </p>
                            </li>
                            <li>
                                <h1 className="font-bold">
                                    সুস্থ ও সুরক্ষিত পরিবেশ
                                </h1>
                                <p>
                                    শিক্ষার্থীদের জন্য সুস্থ ও সুরক্ষিত পরিবেশ
                                    তৈরি করতে আমাদের বিদ্যালয় আধুনিক সুরক্ষা
                                    ব্যবস্থা এবং মনোরম পরিবেশ প্রদান করে।
                                </p>
                            </li>
                        </ul>
                    </div>
                </div>
                <div className="order-1 md:order-2">
                    <div>
                        <img
                            className="rounded-lg"
                            src="https://i.ibb.co.com/SxtJdzT/school.jpg"
                            alt=""
                        />
                    </div>

                    <div className="grid grid-cols-1 md:grid-cols-3 gap-2 md:gap-4 mt-5 bg-[#027afb10] p-4 rounded-lg">
                        <div className="md:col-span-1">
                            <img
                                className="w-full object-cover"
                                src="https://i.ibb.co.com/GsLh2zg/narayan-Chandra.png"
                                alt=""
                            />
                            <p className="text-center mt-2">সিরাজুল ইসলাম</p>
                        </div>
                        <div className="md:col-span-2">
                            <div>
                                <h1 className="text-lg font-bold mb-2">
                                    শিরাজুল ইসলাম স্যারের প্রতি শ্রদ্ধা
                                </h1>
                                <p>
                                    আমাদের বিদ্যালয়ের প্রতিষ্ঠাতা, শ্রদ্ধেয়
                                    শিরাজুল ইসলাম স্যার, তার জীবন ও কর্মের
                                    মাধ্যমে আমাদের শিখিয়েছেন শিক্ষার আসল মূল্য
                                    এবং মানবিক গুণাবলীর গুরুত্ব। তার দৃঢ় নেতৃত্ব
                                    এবং শিক্ষার প্রতি অপরিসীম ভালোবাসা আজ আমাদের
                                    বিদ্যালয়কে এক অনন্য উচ্চতায় নিয়ে এসেছে।
                                    স্যার শুধুমাত্র একজন প্রতিষ্ঠাতা নয়, তিনি
                                    আমাদের জন্য ছিলেন একজন পথপ্রদর্শক, যিনি তার
                                    কঠোর পরিশ্রম ও নিষ্ঠার মাধ্যমে আজকের এই
                                    বিদ্যালয়ের ভিত্তি স্থাপন করেছেন।
                                </p>
                            </div>
                        </div>
                    </div>
                    <div className="bg-[#027afb10] p-4 rounded-lg mt-2">
                        <h1 className="text-lg font-bold mb-2">
                            শ্রদ্ধেয় স্মৃতিতে
                        </h1>
                        <p>
                            আমরা গভীর শ্রদ্ধার সাথে স্মরণ করি শ্রদ্ধেয় শিরাজুল
                            ইসলাম স্যারের অবদান এবং তার অসীম আত্মত্যাগের জন্য।
                            তার স্মৃতি আমাদের হৃদয়ে চিরকাল অমলিন থাকবে, এবং আমরা
                            তার দেখানো পথে এগিয়ে যেতে প্রতিজ্ঞাবদ্ধ।
                        </p>
                    </div>
                </div>
            </div>
        </div>
    );
};

export default About;
